# ANÁLISIS DESCRIPTIVO DE DATOS (EDA)

En este notebook se realiza el análisis descriptivo del dataset **Bank Customer Churn Prediction**, el cual consiste en conocer y enterder los datos con los que se va a trabajar.

Durante esta fase, se intenta responder a las siguientes cuestiones:
- ¿Cuántos registros tiene el conjunto?
- ¿Están todas las filas completas o hay campos con valores nulos?
- ¿De que naturaleza son los datos? (cualitativos o cuantitativos)
- ¿Cuál es la variable target? (la variable a predecir)
- ¿Qué distribución siguen las variables?

## Configuración inicial

** Import lirberías **

In [7]:
import os
import numpy as np
import pandas as pd

from matplotlib import pyplot as plt

** Carga del dataset **

In [13]:
file_path = (os.path.dirname(os.getcwd()) + '/data/')
print(file_path)
data = pd.read_csv(file_path + '/Bank_Customer_Churn_Prediction.csv')

c:\TFG\TFG_ADE/data/

## Presentación de dataset

Visuaización de las variables del dataset

In [50]:
print('Cantidad de filas y columnas del dataset: ', data.shape)
print('\n')
print('Nombre columnas: ')
data.columns.values

Cantidad de filas y columnas del dataset:  (10000, 12)


Nombre columnas:

array(['customer_id', 'credit_score', 'country', 'gender', 'age',
       'tenure', 'balance', 'products_number', 'credit_card',
       'active_member', 'estimated_salary', 'churn'], dtype=object)

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [25]:
#Visualizar las primeras filas del dataset
data.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [35]:
#Comprobación de valores nulos en los datos
print('Cantidad de valores nulos: ')
data.isnull().sum()

Cantidad de valores nulos:

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

In [40]:
#Comprobación de valores duplicados
print('Número de valores duplicados: ', data.duplicated().sum())

Número de valores duplicados:  0

In [45]:
data.nunique()

customer_id         10000
credit_score          460
country                 3
gender                  2
age                    70
tenure                 11
balance              6382
products_number         4
credit_card             2
active_member           2
estimated_salary     9999
churn                   2
dtype: int64

El dataset contiene **10.000** registros y tiene **12** columnas

## Distribución de las variables

In [61]:
stats_order = ['mean', 'std', 'max', 'min','25%', '50%', '75%',]
data[['age','tenure','credit_score', 'balance', 'products_number', 'credit_card', 'active_member', 'estimated_salary', 'churn']].describe().loc[stats_order].T

,mean,std,max,min,25%,50%,75%
age,38.921800,10.487806,92.00,18.00,32.00,37.000,44.0000
tenure,5.012800,2.892174,10.00,0.00,3.00,5.000,7.0000
credit_score,650.528800,96.653299,850.00,350.00,584.00,652.000,718.0000
balance,76485.889288,62397.405202,250898.09,0.00,0.00,97198.540,127644.2400
products_number,1.530200,0.581654,4.00,1.00,1.00,1.000,2.0000
credit_card,0.705500,0.455840,1.00,0.00,0.00,1.000,1.0000
active_member,0.515100,0.499797,1.00,0.00,0.00,1.000,1.0000
estimated_salary,100090.239881,57510.492818,199992.48,11.58,51002.11,100193.915,149388.2475
churn,0.203700,0.402769,1.00,0.00,0.00,0.000,0.0000